tests/performance/load-testing/artillery-config.yml
# Configuration Artillery pour les tests de charge
# Ce fichier définit les scénarios de test avec Artillery.io

config:
  target: "http://localhost:3000"
  phases:
    # Phase de montée en charge graduelle
    - duration: 60
      arrivalRate: 2
      name: "Warmup"
    
    # Phase de charge normale
    - duration: 120
      arrivalRate: 5
      name: "Normal Load"
    
    # Phase de charge élevée
    - duration: 180
      arrivalRate: 10
      name: "High Load"
    
    # Phase de pic de charge
    - duration: 60
      arrivalRate: 20
      name: "Spike"
    
    # Phase de récupération
    - duration: 120
      arrivalRate: 5
      name: "Recovery"
  
  defaults:
    headers:
      Content-Type: "application/json"
      User-Agent: "Artillery-LoadTest/2.0"
    timeout: 30000

scenarios:
  # Scénario de navigation utilisateur standard
  - name: "User Navigation Flow"
    weight: 30
    flow:
      # Page d'accueil
      - get:
          url: "/"
          expect:
            - statusCode: [200, 301]
      
      # API documents
      - get:
          url: "/api/documents"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      # Profil utilisateur
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{ $randomString() }}"
          expect:
            - statusCode: [200, 401]
      
      # Recherche de documents
      - post:
          url: "/api/search"
          json:
            query: "test document"
            limit: 10
          expect:
            - statusCode: [200, 400]

  # Scénario d'upload de documents
  - name: "Document Upload Flow"
    weight: 25
    flow:
      - get:
          url: "/api/documents/upload-page"
          expect:
            - statusCode: [200, 404]
      
      - post:
          url: "/api/documents"
          json:
            name: "Test Document {{ $randomString() }}"
            type: "pdf"
            size: 1024
          expect:
            - statusCode: [200, 400]
      
      - get:
          url: "/api/documents"
          qs:
            page: 1
            limit: 20
          expect:
            - statusCode: 200

  # Scénario de traitement OCR
  - name: "OCR Processing Flow"
    weight: 20
    flow:
      - post:
          url: "/api/ocr/process"
          json:
            documentId: "{{ $randomInt(1, 1000) }}"
            language: "fr"
            engine: "tesseract"
          expect:
            - statusCode: [200, 404, 400]
      
      - get:
          url: "/api/ocr/history"
          qs:
            page: 1
            limit: 50
          expect:
            - statusCode: 200

  # Scénario de recherche avancée
  - name: "Advanced Search Flow"
    weight: 15
    flow:
      - post:
          url: "/api/search/advanced"
          json:
            query: "document content"
            filters:
              type: "pdf"
              dateFrom: "2024-01-01"
              dateTo: "2024-12-31"
            sort: "relevance"
          expect:
            - statusCode: [200, 400]
      
      - post:
          url: "/api/search/export"
          json:
            queryId: "{{ $randomString() }}"
            format: "csv"
          expect:
            - statusCode: [200, 404, 400]

  # Scénario de gestion des utilisateurs
  - name: "User Management Flow"
    weight: 10
    flow:
      - get:
          url: "/api/users"
          qs:
            page: 1
            limit: 20
          expect:
            - statusCode: [200, 401]
      
      - post:
          url: "/api/users"
          json:
            username: "testuser_{{ $randomString() }}"
            email: "test@example.com"
            role: "user"
          expect:
            - statusCode: [200, 400, 401]
      
      - get:
          url: "/api/users/{{ $randomInt(1, 100) }}"
          expect:
            - statusCode: [200, 404, 401]

# Variables personnalisées
variables:
  testUser:
    username: "artillery_test"
    email: "artillery@test.com"
    password: "test123"
  
  testDocuments:
    - name: "Test PDF 1.pdf"
      type: "pdf"
      size: 2048000
    - name: "Test Doc 2.docx"
      type: "docx"
      size: 1024000

# Plugins Artillery
plugins:
  # Réporter détaillé
  artillery-plugin-html-report:
    output: reports/artillery-report.html
  
  # Métriques personnalisées
  artillery-plugin-metrics-by-endpoint:
    useOnlyRequestNames: true
  
  # Periodic stats
  artillery-plugin-statsd:
    host: "localhost"
    port: 8125
    prefix: "artillery"
    tag: "load-test"

# Payload pour les tests
payload:
  - path: "data/users.csv"
    fields:
      - "username"
      - "email"
      - "department"
    order: "random"
    skipHeader: true
  
  - path: "data/documents.csv"
    fields:
      - "filename"
      - "type"
      - "size"
      - "tags"
    order: "sequence"
    skipHeader: true

# Surveillances personnalisées
ensure:
  p99: 1000  # 99% des requêtes sous 1 seconde
  p95: 500   # 95% des requêtes sous 500ms
  p90: 300   # 90% des requêtes sous 300ms
  maxErrorRate: 5  # Taux d'erreur maximum 5%

# Handlers d'événements
handlers:
  - name: "Log Request"
    event: "request"
    log: "Request {{ request.method }} {{ request.url }} - {{ response.statusCode }}"
  
  - name: "Track Errors"
    event: "response"
    ifTrue: "response.statusCode >= 400"
    log: "Error {{ response.statusCode }} on {{ request.url }}"
  
  - name: "Performance Alert"
    event: "response"
    ifTrue: "response.timings.response > 2000"
    log: "Slow response {{ response.timings.response }}ms on {{ request.url }}"